
/*
IMPORT_FUNC "ThreadManForUser",0x6B30100F,sceKernelUnlockMutex
IMPORT_FUNC "ThreadManForUser",0xB011B11F,sceKernelLockMutex
IMPORT_FUNC "SysclibForKernel",0x10F3BB61,memset
IMPORT_FUNC "SysclibForKernel",0xAB7592FF,memcpy
PSP_EXPORT_FUNC_NID(sceClockgenSetSpectrumSpreading, 0xC9AF3102)
*/
#include <pspkernel.h>
#include <pspuser.h>
#include <pspsdk.h>
#include <pspthreadman.h>
#include <pspmodulemgr.h>
#include <pspusbbus.h>
#include <string.h>
#include "sceUsb1Seg.h"

SCE_MODULE_INFO
(
	"sceUSB1Seg_Driver",
	0x1006,	// SCE_MODULE_KERNEL | SCE_MODULE_ATTR_EXCLUSIVE_LOAD | SCE_MODULE_ATTR_EXCLUSIVE_START
	1, 2
);

typedef struct _ONESEG_PARAM
{
	u8	size;
	u8	unk1;
	u8	unk2;
	u8	unk3;
	u32	unk4;
	u8	unk8;
	u8	unk9;
	u8	unk10;
	u8	unk11;
	u32	unk12;
	u8	unk16;
} ONESEG_PARAM __attribute__((packed));	// 17 bytes

typedef struct _PACKET_BUF
{
	_PACKET_BUF	*lpNext;
	u32	unk4;
	s64	qwSysTime;
	u8	buf[192];
} PACKET_BUF __attribute__((packed));	// 208 bytes

/*================================*/
int sub_00001A74();	// OK?
int sub_00001AF8();	// OK?
int sub_00001B7C(u8 chNum);	// OK
sub_00001C80_ScanCh(s8 *a0);	// OK?
int sub_00001DD0_GetModule(u8 *a0);	// OK
int sub_00001E94(ONESEG_PARAM *lpParam);	// OK
int sub_00001FF0(u8 *a0);	// OK?
int sub_000020B4_GetDebug(int *lpDst, int size);	// OK?
int sub_00002184_SetDebug(int *lpSrc, int size);
int sub_000022A4_SetPwm(u8 *a0);
int sub_000023A8_GetReg(s8 a0, u8 *a1, u8 *a2, int a3, int t0);	// OK
int sub_00002518_SetReg(int a0, int *lpSrc, int size);
int sub_0000263C_EEPROMUpdate(s16 a0, int a1, int a2, u8 *a3);
int sub_0000276C_EEPROMParamWrite();
int sub_00002838(u8 *a0, int a1);
int sub_00002934(s8 a0, s8 a1, s8 a2);
int sub_00002A58(u16 a0, u8 *lpDst, u8 size);
int sub_00002BB8(u16 a0, u8 *a1, int a2);
int sub_00002CEC_GetErrorCode(u16 *lpUnk);	// OK

void BulkinReqDone(UsbdDeviceReq *lpDevReq);
int BulkoutReqDone(UsbdDeviceReq *lpDevReq);	// OK
int AsyncReqDone(UsbdDeviceReq *lpDevReq);

int *sub_00003400(int a0, int *a1, int *a2, int *a3);
int sub_00003664_GetData(int *lpDst, int size);	// OK
int sub_00003708();
int sub_000037D4_SetAntenna(int ch);
int sub_000038D8_SetBPER(int ch);
int sub_00003AB8();	// OK
int sub_00003B70();	// OK?
sub_00003C38();
int sub_00003F74();
int sub_000042EC();
/*================================*/

// a function comes from a syscall, $k1 = 0x100000 by interruptmgr
// 0+224+228 : threadEntry

struct UsbEndpoint	g_bulkinEndpoint;	// 0x00000 + 128 + 0
struct UsbEndpoint	g_usbEndpoint;	// 0x00000 + 128 + 12

//UsbDriver g_driver	// 0x00000 + 164	// 68bytes

int	g_bStarted;	// 0x00000 + 244 + 0
int	g_bAttached;	// 0x00000 + 244 + 4
int	g_alternateSetting;	// 0x00000 + 244 + 8
int	g_onesegState;	// 0x00000 + 244 + 12
int	g_errorCode16;	// 0x00000 + 244 + 16
s8	g_chNum;	// 0x00000 + 244 + 20
ONESEG_PARAM	g_onesegParam;	// 0x00000 + 244 + 21

struct UsbdDeviceReq	g_deviceReq;	// 0x00000 + 244 + 40
u8	*g_lpData;	// 0x00000 + 244 + 80
u8	*g_cmdResult;	// 0x00000 + 244 + 85
/* Static bulkin request structure */
struct UsbdDeviceReq	g_bulkinReq2;	// 0x00000 + 244 + 88
struct UsbdDeviceReq	g_bulkinReq;	// 0x00000 + 244 + 92,	0x00000 + 336
/* Static bulkout request structure */
//static UsbdDeviceReq g_bulkoutReq;	// 0x00000 + 244 + 132
u8	*g_lpBulkinData;	// 0x00000 + 244 + 132
struct UsbdDeviceReq	g_usbReq;	// 0x00000 + 244 + 136
/* Async request */
//static UsbdDeviceReq g_asyncReq;	// 0x00000 + 244 + 172
u8	*g_lpUsbData;	// 0x00000 + 244 + 176
int g_index180;	// 0x00000 + 244 + 180
int	g_index;	// 0x00000 + 244 + 184
struct PACKET_BUF	*g_lpPcktBufs[2];	// 0x00000 + 244 + 188

int g_cb1Arg2;	// 0x00000 + 244 + 196
int	g_num200;	// 0x00000 + 244 + 200
int	g_num204;	// 0x00000 + 244 + 204	// packet_num?

struct PACKET_BUF	*g_lpPcktBuf1;	// 0x00000 + 244 + 208
struct PACKET_BUF	*g_lpPcktBuf2;	// 0x00000 + 244 + 212
struct PACKET_BUF	*g_lpBuf;	// 0x00000 + 244 + 216
struct PACKET_BUF	*g_lpBufTmp;	// 0x00000 + 244 + 220

int	g_threadID;	// 0x00000 + 244 + 228
int	g_eventFlag;	// 0x00000 + 244 + 232
int g_poolUID;	// 0x00000 + 244 + 236
int	g_mutexID;	// 0x00000 + 244 + 240

SceUID	g_cbUID1;	// 0x00000 + 244 + 244
SceUID	g_cbUID2;	// 0x00000 + 244 + 248

#define ERR_1	0x80244501
#define ERR_2	0x80244502	// Not started
#define ERR_3	0x80244503	// Not attached
#define ERR_4	0x80244504
#define ERR_5	0x80244505
#define ERR_6	0x80244506
#define ERR_7	0x80244507
#define ERR_8	0x80244508
#define ERR_9	0x80244509
#define ERR_C	0x8024450C
#define ERR_D	0x8024450D

#define K1PtrOk(p)	(( (int)(p) & pspSdkGetK1() ) >= 0)
#define K1StaBufOk(p, size)		( (( ((int)(p) + size) | (int)(p) ) & pspSdkGetK1() ) >= 0)
#define K1DynBufOk(p, size)	( (( ((int)(p) + size) | (int)(p) | size ) & pspSdkGetK1() ) >= 0)

// values
int sceUsb1SegConstruct(s8 chNum, ONESEG_PARAM *lpParam, SceUID *uid1, SceUID uid2) // at 0x00000000 - Aliases: sceUsb1Seg_driver_4B8C03AA
{
	if (!g_bStarted)
	{
		g_cbUID1 = 0;
		g_cbUID2 = 0;
		return (0x80244502);
	}
	if (!g_bAttached)
	{
		g_cbUID1 = 0;
		g_cbUID2 = 0;
		return (0x80244503);
	}
	if ((chNum - 13) < 50 == 0)
	{
		g_cbUID1 = 0;
		g_cbUID2 = 0;
		return (0x80244505);
	}

	int ret;
